; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	image3 - mode
	thermograph1 - mode
	spectrograph0 - mode
	thermograph2 - mode
	GroundStation0 - direction
	GroundStation1 - direction
	GroundStation4 - direction
	GroundStation5 - direction
	GroundStation6 - direction
	Star2 - direction
	GroundStation3 - direction
	Star7 - direction
	Phenomenon8 - direction
	Phenomenon9 - direction
	Planet10 - direction
	Star11 - direction
	Planet12 - direction
	Phenomenon13 - direction
	Star14 - direction
	Phenomenon15 - direction
	Star16 - direction
	Planet17 - direction
)
(:init
	(supports instrument0 thermograph1)
	(supports instrument0 image3)
	(supports instrument0 thermograph2)
	(supports instrument0 spectrograph0)
	(calibration_target instrument0 GroundStation3)
	(calibration_target instrument0 Star2)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star2)
)
(:goal (and
	(pointing satellite0 GroundStation4)
	(have_image Star7 spectrograph0)
	(have_image Phenomenon8 image3)
	(have_image Phenomenon9 thermograph2)
	(have_image Planet10 thermograph1)
	(have_image Star11 thermograph1)
	(have_image Planet12 thermograph1)
	(have_image Phenomenon13 image3)
	(have_image Star14 image3)
	(have_image Phenomenon15 image3)
	(have_image Star16 thermograph2)
	(have_image Planet17 spectrograph0)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 12
2. (calibrate satellite0 instrument0 star2)
   added: (calibrated instrument0)
   goals met: 0 of 12
3. (turn_to satellite0 planet10 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 planet10)
   goals met: 0 of 12
4. (take_image satellite0 planet10 instrument0 thermograph1)
   added: (have_image planet10 thermograph1)
   goals met: 1 of 12
5. (turn_to satellite0 phenomenon9 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 phenomenon9)
   goals met: 1 of 12
6. (take_image satellite0 phenomenon9 instrument0 thermograph2)
   added: (have_image phenomenon9 thermograph2)
   goals met: 2 of 12
7. (turn_to satellite0 phenomenon8 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 phenomenon8)
   goals met: 2 of 12
8. (take_image satellite0 phenomenon8 instrument0 image3)
   added: (have_image phenomenon8 image3)
   goals met: 3 of 12
9. (turn_to satellite0 phenomenon15 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 phenomenon15)
   goals met: 3 of 12
10. (take_image satellite0 phenomenon15 instrument0 image3)
   added: (have_image phenomenon15 image3)
   goals met: 4 of 12
11. (turn_to satellite0 phenomenon13 phenomenon15)
   deleted: (pointing satellite0 phenomenon15)
   added: (pointing satellite0 phenomenon13)
   goals met: 4 of 12
12. (take_image satellite0 phenomenon13 instrument0 image3)
   added: (have_image phenomenon13 image3)
   goals met: 5 of 12
13. (turn_to satellite0 planet12 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 planet12)
   goals met: 5 of 12
14. (take_image satellite0 planet12 instrument0 thermograph1)
   added: (have_image planet12 thermograph1)
   goals met: 6 of 12
15. (turn_to satellite0 planet17 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 planet17)
   goals met: 6 of 12
16. (take_image satellite0 planet17 instrument0 spectrograph0)
   added: (have_image planet17 spectrograph0)
   goals met: 7 of 12
17. (turn_to satellite0 star11 planet17)
   deleted: (pointing satellite0 planet17)
   added: (pointing satellite0 star11)
   goals met: 7 of 12
18. (take_image satellite0 star11 instrument0 thermograph1)
   added: (have_image star11 thermograph1)
   goals met: 8 of 12
19. (turn_to satellite0 star14 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 star14)
   goals met: 8 of 12
20. (take_image satellite0 star14 instrument0 image3)
   added: (have_image star14 image3)
   goals met: 9 of 12
21. (turn_to satellite0 star16 star14)
   deleted: (pointing satellite0 star14)
   added: (pointing satellite0 star16)
   goals met: 9 of 12
22. (take_image satellite0 star16 instrument0 thermograph2)
   added: (have_image star16 thermograph2)
   goals met: 10 of 12
23. (turn_to satellite0 star7 star16)
   deleted: (pointing satellite0 star16)
   added: (pointing satellite0 star7)
   goals met: 10 of 12
24. (take_image satellite0 star7 instrument0 spectrograph0)
   added: (have_image star7 spectrograph0)
   goals met: 11 of 12
25. (turn_to satellite0 groundstation4 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 groundstation4)
   goals met: 12 of 12
